# -*- coding: utf-8 -*-
from lesson_005 import my_burger
# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

# В этом модуле создать рецепт двойного чизбургера (https://goo.gl/zA3goZ)
# с помощью фукций из my_burger и вывести на консоль.

# Создать рецепт своего бургера, по вашему вкусу.
# Если не хватает инградиентов - создать соответствующие функции в модуле my_burger

# TODO здесь ваш код
print('Давайте приготовим "Двойной Чизбургер":')
my_burger.get_double_cheeseburger()
print('\nИ мой любимый рецепт - "Чикен Гурмэ Экзотик":')
my_burger.get_chicken_gurme_exotic()

# TODO Убирайте TODO
#  Функции рисования частей бургеров нужно вызывать в этом модуле.
